app/controllers/contacts_controller.rb

  def create
    @contacts = Contact.all
    @contact = Contact.new(params[:contact])
    respond_to do |format|
      format.js do
        render :update do |page|
          if @contact.save
            unless @contact.group_id == nil
              page.replace_html 'groups_container', :partial => 'groups/group', :collection => Group.all
              page.replace_html 'contacts_container', :partial => @contact.group.contacts.sort!{|f,g| f.name <=> g.name}
---
SELECT * FROM `contacts` WHERE (`contacts`.group_id = 1)
INSERT INTO `contacts` (`name`, `company`, `address`, `created_at`, `updated_at`, `group_id`, `phone`) VALUES('asdf', 'asdf', 'asdfasdf', '2010-06-23 02:49:36', '2010-06-23 02:49:36', NULL, '1343214')
SELECT * FROM `groups`
SELECT * FROM `groups` WHERE (`groups`.`id` = 1)

  def update
    respond_to do |format|
      format.js do
        render :update do |page|
          if @contact.update_attributes(params[:contact])
---
UPDATE `contacts` SET `updated_at` = '2010-06-23 02:56:54', `address` = '' WHERE `id` = 1

  def show_all_contacts
    @contacts = Contact.all
---
SELECT * FROM `contacts`

  def show_filter
    r = Regexp.new(/str/i)
    results = ""
    @contacts = Contact.all
---
SELECT * FROM `contacts`

  def find_contact
    @contact = Contact.find(params[:id])
---
SELECT * FROM `contacts` WHERE (`contacts`.`id` = 4)

  def find_groups
    @groups = Group.all
---
SELECT * FROM `groups`