app/controllers/groups_controller.rb

SELECT * FROM `contacts` WHERE (`contacts`.group_id = 1)
SELECT * FROM `groups`
---
  def index
    @contacts = Contact.all
    @groups = Group.all

INSERT INTO `groups` (`created_at`, `title`, `updated_at`) VALUES('2010-06-22 16:51:40', 'form', '2010-06-22 16:51:40')
---
  def create
    @groups = Group.all
    @group = Group.new(params[:group])
    respond_to do |format|
      format.js do
        render :update do |page|
          if @group.save

SELECT * FROM `groups` WHERE (`groups`.`id` = 8)
SELECT * FROM `contacts` WHERE (`contacts`.group_id = 2)
SELECT count(*) AS count_all FROM `contacts` WHERE (`contacts`.group_id = 8)
---
  def show_contacts
    @group = Group.find(params[:id])
    @contacts = @group.contacts
    respond_to do |format|
      format.js do
        render :update do |page|
          unless @contacts.empty?

SELECT * FROM `groups` WHERE (`groups`.`id` = 1)
---
  def display_edit
    @group = Group.find(params[:id])

SELECT * FROM `groups` WHERE (`groups`.`id` = 1)
---
  def clear_form
    @group = Group.find(params[:id])

SELECT * FROM `groups` WHERE (`groups`.`id` = 1)
DELETE FROM `groups` WHERE `id` = 1
SELECT * FROM `groups`
---
  def destroy_group
    @group = Group.find(params[:id])
    @group.delete_contacts
    @group.destroy
    @groups = Group.all